#Напишите программу, удаляющую из текста все слова, содержащие ""абв"

list= "абвдлодоьбабвджлвбав"
print(list)
lis=list.replace("абв","")
print(lis)